
# 在这一课中，我们将重点介绍运算符和表达式。运算符用于执行数学或逻辑运算，而表达式则是由运算符和操作数（即被操作的变量或常量）组成的组合，用于产生特定结果。
# Python支持多种类型的运算符，其中包括算术运算符、比较运算符、逻辑运算符和赋值运算符等。
# 以下是一些常见的运算符示例：

# 算术运算符
# +   -   *   /   //    %   **

# 比较运算符
# ==  !=  >   >=   <   <=

# 逻辑运算符
# and   or   not

# 赋值运算符
# = +=   -=   *=   /=   //=    %=   **=

# 我们可以使用这些运算符来构建表达式，例如：

# 算术表达式
result1 = 5 + 3
result2 = 2 * 10

# 比较表达式
result3 = 2 > 3
result4 = "hello" == "world"

# 逻辑表达式
result5 = result3 and result4

# 赋值表达式
x = 10
y = x + 5
x += y
print(x) # 输出：25